In [2]:
import pandas as pd ; import numpy as np

In [4]:
s=pd.Series(["ege",np.nan,"ali","eda"])
s

0    ege
1    NaN
2    ali
3    eda
dtype: object

In [5]:
s.isnull()

0    False
1     True
2    False
3    False
dtype: bool

In [6]:
s.notnull()

0     True
1    False
2     True
3     True
dtype: bool

In [7]:
s[3]=None

In [8]:
s.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [9]:
s.dropna()  # eksik verileri kaldırılır

0    ege
2    ali
dtype: object

In [10]:
s[s.notnull()]   #eksik olmayanlar kalır

0    ege
2    ali
dtype: object

In [11]:
#### DataFrame'de Eksik Veri ####

In [12]:
from numpy import nan as NA

In [14]:
df=pd.DataFrame([[1,2,3],[4,NA,5],[NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [18]:
df.dropna()  #eksik veri içeren satırları çıkarır

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [19]:
df.dropna(how="all")  #bütün değerleri eksik olan satırları çıkarır

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [20]:
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [21]:
df[1]=NA
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [24]:
df.dropna(axis=1,how="all")  #sütundaki tüm değerleri eksik veri olan sütunu çıkarır

     0    2
0  1.0  3.0
1  4.0  5.0
2  NaN  NaN

In [25]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [30]:
df.dropna(thresh=1)
# en az bir değeri olan satırlar ekrana yazılır

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0

In [31]:
df.dropna(thresh=1)
# en az iki değeri olan satırlar ekrana yazılır

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0

In [ ]:

### EKSİK VERİYİ TAMAMALAMA ###

In [32]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [33]:
df.fillna(0)   #eksik değerlere bir değer atama

     0    1    2
0  1.0  0.0  3.0
1  4.0  0.0  5.0
2  0.0  0.0  0.0

In [34]:
df.fillna({0:15,1:20,2:35}) #eksik değerlere farklı değerler atama

      0     1     2
0   1.0  20.0   3.0
1   4.0  20.0   5.0
2  15.0  20.0  35.0

In [35]:
df   #üzerinde iş yapsak da df yine aynı df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [37]:
#df'nin değişmesi için;
#inplace=True ifadesi kullanılır

df.fillna(0,inplace=True)
df

     0    1    2
0  1.0  0.0  3.0
1  4.0  0.0  5.0
2  0.0  0.0  0.0

In [38]:
df=pd.DataFrame([[1,2,3],[4,NA,5],[NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [41]:
df.fillna(method="ffill")
#df veri setindeki eksik verilerin yerine verilerin üst satırındaki değer atanır

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  4.0  2.0  5.0

In [42]:
df.fillna(method="ffill",limit=1)
#df veri setindeki eksik verilerin yerine verilerin "bir" üst satırındaki değer atanır

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  4.0  NaN  5.0

In [43]:
### eksik verilerin yerine verilerin ortalamasını atama

veri=pd.Series([1,0,NA,5])
veri

0    1.0
1    0.0
2    NaN
3    5.0
dtype: float64

In [44]:
veri.fillna(veri.mean())

# (1+5)/3=2

0    1.0
1    0.0
2    2.0
3    5.0
dtype: float64

In [45]:
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [46]:
df.fillna(df.mean())  #herbir sütundaki değerlerin ortalamasını eksik veri değerlerine yazar

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  2.5  2.0  4.0

In [48]:
df.fillna(df.mean(axis=1)) #herbir satırdaki değerlerin ortalamasını eksik veri değerlerine yazar

     0    1    2
0  1.0  2.0  3.0
1  4.0  4.5  5.0
2  2.0  4.5  NaN